import {
  img11,
  img12,
  img14,
  img15,
  img16,
  img17,
  img110,
  img112,
  img113,
  img115,
  img116,
  img22,
  img23,
  img24,
  img25,
  img26,
  img211,
  img212,
  img213,
  img214,
  img215,
  img216,
  img32,
  img33,
  img34,
  img35,
  img36,
  img312,
  img313,
  img315,
  img316,
  img317,
  img319,
  img362,
  img363,
  img364,
  img366,
  img368,
  img369,
  img371,
  img376,
  img377,
  img379,
} from "../images";

export const bilet = [
  [
    {
      quiz_id: 1,
      id: 0,
      img: img11,
      question:
        " Бу белгиларнинг таъсир оралиғида қайси автомобил учун тўхташга рухсат берилади?",
      answer: [
        "Қизилга",
        "Иккала автомобилга",
        "Ҳеч қайси бирига",
        "Capиқ автомобилга",
      ],
      right: 3,
    },
    {
      id: 1,
      img: img12,
      question:
        "Йўналтиргичларнинг қайсилари бўйлаб ҳаракатланишга рухсат этилади?",
      answer: [
        "Фақат А йўналиш бўйлаб",
        "Фақат Б йўналиш бўйлаб",
        "Фақат В йўналиш бўйлаб",
        "Фақат А ва Г йўналишлари бўйлаб",
        "Фақат Г йўналиш бўйлаб",
      ],
      right: 3,
    },
    {
      id: 2,
      img: null,
      question:
        "Тиббиёт қутичаси ва ўт ўчиргич бўлмаган қандай траснпорт воситаларидан фойнадаланиш тақиқланади?",
      answer: [
        "Фақат M1 тоифали траснпорт воситаcи",
        " Фақат M2; M3; N1 тоифали траснпорт воситаcи",
        "Фақат N2; N3 тоифали траснпорт воситаcи",
        "Ҳамма санаб ўтилган транспорт воситаларидан",
      ],
      right: 3,
    },
    {
      id: 3,
      img: img14,
      question: "Чорраҳадан биринчи бўлиб ўтади:",
      answer: [
        "Қизил автомобил",
        "Кўк автомобил",
        "Сариқ автомобил",
        "Яшил автомобил",
      ],
      right: 3,
    },
    {
      id: 4,
      img: img15,
      question: "Ҳаракатланиш таъқиқланади:",
      answer: [
        "Қизил ва оқ автомобилларга",
        "Кўк, яшил ва оқ автомобилларга",
        "Оқ, кўк ва сариқ автомобилларга",
      ],
      right: 1,
    },
    {
      id: 5,
      img: img16,
      question:
        "Қайси транспорт воситасининг ҳайдовчиси чорраҳадан биринчи бўлиб ўтади?",
      answer: ["Автомобил ва автобус ҳайдовчиси", "Трамвай ҳайдовчиси"],
      right: 0,
    },
    {
      id: 6,
      img: img17,
      question: "Шу жойда тўхтаб туришга рухсат этиладими?",
      answer: ["Рухсат этилади", "Таъқиқланади"],
      right: 0,
    },
    {
      id: 7,
      img: null,
      question:
        "Ҳайдовчи ҳаракатланишни бошлашидан олдин қандай амалларни бажариши керак?",
      answer: [
        "Транспорт воситасининг созлигини ва тўла жихозланганлигини текшириши",
        "Ҳаракатланиш бошланиши ҳавфсиз бўлишига ва ҳаракатнинг бошқа иштирокчиларига ҳалақит бермаслигига ишонч ҳосил қилиши керак",
        "Тегишли йўналишдаги бурилишнинг ёруғлик кўрсаткичи билан ишора бериши",
        "Санаб ўтилган ҳамма ҳаракатларни бажариши",
      ],
      right: 1,
    },
    {
      id: 8,
      img: null,
      question:
        "Умуртқасининг кўкрак қисми шикастланган киши транспортда қандай ташилади?",
      javob1: "",
      answer: [
        "Қаттиқ тахтада орқаси билан ётган ҳолда",
        "Юмшоқ тушамада орқаси билан ётган ҳолда",
        "Қаттиқ тахтада ёни билан ётган ҳолда",
      ],
      right: 0,
    },
    {
      id: 9,
      img: img110,
      question:
        "Бундай таниқлик белгиси билан белгиланадиган транспорт воситаси:",
      answer: [
        "Оғир вазнли ва йирик ўлчамли юкларни ташувчи",
        "Узунлиги юк билан ёки юксиз 20 метрдан ортиқ бўлган транспорт воситаси",
        "Фургон юкхонасида одамларни ташувчи",
      ],
      right: 1,
    },
    {
      id: 10,
      img: null,
      question:
        "Сарғиш рангли милтилловчи чироқ ёқилган ҳолатда ҳаракатланиш учун имтиёз берадими?",
      answer: ["Ҳа", "Йўқ"],
      right: 1,
    },
    {
      id: 11,
      img: img112,
      question:
        "Қўйидаги белгилар қайси йўналишда ҳаракатланишга рухсат беради?",
      answer: [
        "Фақат чапга",
        "Фақат тўғрига",
        "Фақат ўнгга",
        "Тўғрига, ўнгга ва қайрилишга",
      ],
      right: 3,
    },
    {
      id: 12,
      img: img113,
      question: "Мазкур чизиқ нима ҳақида огоҳлантиради?",
      answer: [
        " Транспорт воситаларининг мажбурий тўхташ жойига яқинлашаётгани",
        " «Тўхтамасдан ҳаракатланиш тақиқланган» белгиси билан бирга қўлланилганда ҳайдовчини «Тўхташ» чизиғига яқинлашаётганлигини",
        "Транспорт воситаси пиёдаларга йўл бериши керак бўлган жойни кўрсатади",
      ],
      right: 1,
    },
    {
      id: 13,
      img: null,
      question: "Автомагистралда қуйидагилар таъқиқланади:",
      answer: [
        "Қайрилиб олиш ва ажратувчи бўлакнинг технологик ўзилиш жойларига кириш",
        "Орқага ҳаракатланиш",
        " «Тўхтаб туриш жойи» ёки «Дам олиш жойи» белгилари бўлган махсус майдончалардан ташқари жойда тўхташ",
        "Юқоридаги барча ҳолатлар",
      ],
      right: 3,
    },
    {
      id: 14,
      img: img115,
      question:
        "Қайси транспорт воситаси ҳайдовчиси тўғрига ҳаракатланиш ҳуқуқига эга?",
      answer: [
        " Автобус ва мотоцикл ҳайдовчилари",
        "Енгил ва юк автомобиллари ҳайдовчилари",
        "Енгил автомобил ҳайдовчиси",
      ],
      right: 2,
    },
    {
      id: 15,
      img: img116,
      question: "Қайси транспорт воситасининг ҳайдовчиси йўл бериши керак?",
      answer: ["Автомобил ҳайдовчиси", "Трамвай ҳайдовчиси"],
      right: 1,
    },
    {
      id: 16,
      img: null,
      question:
        "Транспорт воситасини орқага ҳаракатлантириш пайтида ҳайдовчи қандай талабларни бажариши керак?",
      answer: [
        "Ҳаракатнинг бошқа иштирокчиларига ҳалақит бермаслик. Ҳаракат ҳавфсизлигини таъминлаш учун зарур бўлса, бошқа шахслар ёрдамидан фойдаланиш",
        "Бошқа шахслар ёрдамидан фойдаланиш",
        "Транспорт воситасида туманга қарши чироқлар бўлса, уларни ёқиш",
        "Габарит чироқларини ёқиш",
      ],
      right: 0,
    },
    {
      id: 17,
      img: null,
      question:
        "Йўлнинг қарама-қарши ҳаракат йўналиши томонига чиқиш қачон  таъқиқланади?",
      answer: [
        "Икки томонлама ҳаракатли, 4та ёки ундан кўп бўлакли йўлларда ",
        "Икки томонлама ҳаракатли, қарама-қарши йўналишдаги транспорт воситалари оқимлари иккита узлуксиз чизиқлар билан ажратилган, 4та бўлакли йўлларда",
        "Юқоридаги барча ҳолларда",
      ],
      right: 2,
    },
    {
      id: 18,
      img: null,
      question:
        "Қайси ҳолатда эгри йўлда ҳаракатланаётган автомобил турғунлиги таъминланган?",
      answer: [
        "Узатма уланган ҳолатда",
        "Узатма ажратилган ҳолатда",
        "Тезлик оширилганда",
      ],
      right: 0,
    },
    {
      id: 19,
      img: null,
      question:
        "Қайси шартларда транспорт воситаларидан фойдаланиш таъқиқланади?",
      answer: [
        "Гидравлик тормоз тизимидан суюқлик оқаётган бўлса",
        "Ишчи тормоз тизими самарадорлиги талабга жавоб бермайди",
        "Компрессор пневматик тормоз тизимида ўрнатилган босимни таъминлай олмаган ҳолатда",
        "Кўрсатилган барча ҳолатларда",
      ],
      right: 3,
    },
  ],
  [
    {
      quiz_id: 2,
      id: 0,
      img: null,
      question:
        "Ҳайдовчи ўз ҳаракати йўналишидан қатъий назар кимга транспорт воситасини тақдим этиши керак?",
      answer: [
        "Йўл хизмати ходимларига",
        "Тиббиёт ходимларига зудлик билан тиббий ёрдамга мухтож бўлган фукароларни даволаш-профилактика муассасасига олиб бориш учун",
      ],
      right: 1,
    },
    {
      id: 1,
      img: img22,
      question: "Қайси йўналишларда ҳаракатланишга рухсат этилган?",
      answer: ["Фақат Б", "Фақат А", "А ва Б", "А, Б, В ва Г", "А, Б ва В"],
      right: 2,
    },
    {
      id: 2,
      img: img23,
      question:
        "Қайси белги қарама-қарши ҳаракатланишнинг устунлигини билдиради?",
      answer: [1, 2, 3, 4, 5],
      right: 1,
    },
    {
      id: 3,
      img: img24,
      question:
        "Қайси белги Қоидаларнинг аҳоли пунктларида ҳаракатланиш тартибини белгилайдиган талабларнинг бекор килинишини кўрсатади?",
      answer: [1, 2, 3, 4, 5],
      right: 3,
    },
    {
      id: 4,
      img: img25,
      question:
        "Ўнгга бурилганда шу белги билан белгиланган бўлакка ўтишга рухсат этиладими?",
      answer: [
        "Рухсат этилади",
        "Таъқиқланади",
        "Агар бўлак қолган ҳаракат қисмидан ётиқ узлуксиз чизиқ билан ажратилмаган бўлса, рухсат этилади",
      ],
      right: 2,
    },
    {
      id: 5,
      img: img26,
      question: "Транспорт воситалари чорраҳадан қуйидаги тартибда ўтадилар:",
      answer: [
        "Трамвай ва автобус, енгил автомобил",
        "Трамвай, енгил автомобил, автобус",
        "Енгил автомобил, трамвай ва автобус",
      ],
      right: 2,
    },
    {
      id: 6,
      question:
        "Автомобилнинг қайси гилдираги «сирпаниб» тормозланишга кўпроқ мойил?",
      answer: ["Орқа ғилдираклар", "Олдинги ғилдираклар"],
      right: 0,
    },
    {
      id: 7,
      img: null,
      question:
        "Қайси транспорт воситаларини қатнов қисмнинг четида икки қатор қўйиш мумкин?",
      answer: [
        "Кажавасиз мотоцикллар, мопедлар ва велосипедлар",
        "Кажавали мотоцикллар",
        "«Ногирон» таниқли белгиси бўлган енгил автомобиллар",
        "Рухсат этилган тўла вазни 3,5 т. дан кам бўлган, бевосита тротуарлар бўйлаб жойлашган савдо ва бошқа корхоналарга хизмат қилувчи юк автомобиллари",
      ],
      right: 0,
    },
    {
      id: 8,
      img: null,
      question: "Қўл жароҳатланганда кийим қандай тартибда кийгизилади?",
      answer: [
        "Кийим аввал жароҳатланган қўлга, сўнгра соғига кийдирилади",
        "Кийим иккала қўлга баравар кийдирилади",
        "Кийим аввал соғ қўлга, сўнгра жароҳатланган қўлга кийдирилади",
      ],
      right: 0,
    },
    {
      id: 9,
      img: null,
      question: "Юк транспорт воситасига шундай жойлаштирилиши керакки, у:",
      answer: [
        "Юкхона деворларидан баланд чиқмаслиги керак",
        "Шовқин ҳосил қилмаслиги, чанг кўтармаслиги ва атроф-мухитни ифлос қилмаслиги керак",
        "Транспорт воситасининг орқа ўлчамидан 0,8 м. дан ортиқ чиқиб турмаслиги керак",
      ],
      right: 1,
    },
    {
      id: 10,
      img: img211,
      question: "Мазкур йўл белгиси нимани билдиради?",
      answer: [
        "Йўлнинг тротуар ёки пиёдалар йўлкаси бўлган қисмини",
        "Йўлнинг пиёдалар ўтиш жойи бўлган қисмини",
      ],
      right: 1,
    },
    {
      id: 11,
      img: img212,
      question: "Қайси транспорт воситаларига тўхтаб туришга рухсат этилган?",
      answer: [
        "Фақат мотоциклга",
        "Фақат юк автомобилига",
        "Фақат енгил автомобилга",
        "Енгил автомобил ва мотоциклга",
        "Барча транспорт воситаларига",
      ],
      right: 3,
    },
    {
      id: 12,
      img: img213,
      question: "Ушбу йўл белгиси нима ҳақида огоҳлантиради?",
      answer: [
        "Бир изли темир йўл кесишмасигa яқинлашаётганлиги ҳақида",
        "Шлагбаум билан жихозланмаган бир изли темир йўл кесишмаси борлигидан",
        "Шлагбаум билан жихозланмаган икки изли темир йўл кесишмаси борлигидан",
      ],
      right: 1,
    },
    {
      id: 13,
      img: img214,
      question: "Яшил автомобил чорраҳадан нечанчи бўлиб ўтади?",
      answer: ["Иккинчи", "Биринчи"],
      right: 0,
    },
    {
      id: 14,
      img: img215,
      question: "Қайси  транспорт воситасига ҳаракатланиш рухсат этилади?",
      answer: [
        "Мотоциклга",
        "Юк автомобилига ",
        "Автобусга",
        "Енгил автомобилга",
        "Енгил ва юк автомобилларига",
      ],
      right: 3,
    },
    {
      id: 15,
      img: img216,
      question: "Қайси транспорт воситасининг ҳайдовчиси йўл бериши керак?",
      answer: ["Мотоцикл ҳайдовчиси", "Автомобил ҳайдовчиси"],
      right: 1,
    },
    {
      id: 16,
      img: null,
      question:
        "Ҳаракат икки томонлама бўлган, уч бўлакли йўлда сиз ўнгга бурилишингиз зарур. Ушбу ҳаракатни қайси бўлакдан амалга оширасиз?",
      answer: [
        "Ўнг бўлакдан",
        "Ўрта бўлакдан",
        "Ўнг ёки ўрта бўлакдан",
        "Ўрта бўлакдан, лекин фақат ўнг бўлак банд бўлганда",
      ],
      right: 0,
    },
    {
      id: 17,
      img: null,
      question:
        "Қайси жойларда транспорт воситаларига қатнов қисмининг четига бурчак остида тўхтаб туришга рухсат этилади?",
      answer: [
        "Ҳар бир йўналишда иккитадан бўлаги бўлган йўлларда",
        "Ҳар бир йўналишда учта ва ундан кўп бўлаги бўлган йўлларда",
        "Фақат бир томонлама ҳаракатли йўлларда",
        "Йўлнинг қатнов қисми кенгайган жойларда бошқа йўл ҳаракати қатнашчиларига ҳалақит бермаслик шарти билан",
      ],
      right: 3,
    },
    {
      id: 18,
      img: null,
      question:
        "Суяк синганда қотириб боғлаш учун нимадан шина сифатида фойдаланиш энг қўлай?",
      answer: ["Бинт", "Газмол", "Тахта бўлаги"],
      right: 2,
    },
    {
      id: 19,
      img: null,
      question:
        "Куннинг қоронғи вақтида сунъий ёритилмаган йўлларда ёки етарли кўринмаслик шароитида ёнмайдиган орқа габарит чироқлари билан тўхтаб туриш ёки таъмирлаш жойига боришга рухсат бериладими?",
      answer: [
        "Алоҳида эҳтиёткорлик билан боришга рухсат берилади ",
        "Таъқиқланади",
      ],
      right: 1,
    },
  ],
  [
    {
      quiz_id: 3,
      id: 0,
      img: null,
      question:
        "Санаб ўтилган ҳолларнинг қайси бирида қоидалар ҳайдовчи ўзининг транспорт воситасини ички ишлар ходими ихтиёрига бериши шарт?",
      answer: [
        "Барча ҳолларда",
        "Кечиктириб бўлмайдиган хизмат вазифаларини бажариш учун",
        "Иш жойига бориш учун",
      ],
      right: 1,
    },
    {
      id: 1,
      img: img32,
      question:
        "Қайси транспорт воситасининг хайдовчиси биринчи навбатда ҳаракатланиш ҳуқуқига эга?",
      answer: ["Юк автомобили ҳайдовчиси", "Автобус ҳайдовчиси"],
      right: 0,
    },
    {
      id: 2,
      img: img33,
      question:
        "Қайси белги транспорт воситаларининг белгида кўрсатилгандан кам оралиқ масофада ҳаракатланишини тақиқлайди",
      answer: [1, 2, 3, 4, 5],
      right: 2,
    },
    {
      id: 3,
      img: img34,
      question:
        "Мазкур ҳолатда автобус тўғрига ҳаракатланса чорраҳага киришига рухсат этиладими?",
      answer: [
        "Рухсат этилади",
        "Таъқиқланади",
        "Агар автобус белгиланган йўналиш бўйича ҳаракатланаётган бўлса рухсат этилади",
      ],
      right: 1,
    },
    {
      id: 4,
      img: img35,
      question: "Кўрсатилган вазиятда қайси бўлакдан ўнгга бурилиш лозим?",
      answer: [
        "Фақат иккинчи бўлакдан",
        "Фақат «А» чизиғи билан белгиланган ўнг чеккадаги бўлакдан",
      ],
      right: 1,
    },
    {
      id: 5,
      img: img36,
      question: "Тартибга солувчининг мазкур ишораси  қўйидагини билдиради:",
      answer: [
        " Кўк, яшил автомобилларга ҳаракатланишга рухсат этилади. Қизил, сариқ, оқ автомобилларга таъқиқланади",
        "Кўк, қизил, яшил автомобилларга ҳаракатланишга рухсат этилади. Сариқ, оқ автомобилларга таъқиқланади",
      ],
      right: 1,
    },
    {
      id: 6,
      img: null,
      question:
        "Аҳоли пунктларидан ташқарида енгил автомобилларнинг қандай энг катта тезлик билан ҳаракатланишига рухсат этилади?",
      answer: ["110 км/c", "100 км/c", "90 км/c", "80 км/c", "70 км/c"],
      right: 1,
    },
    {
      id: 7,
      img: null,
      question:
        "Чорраҳада айланма ҳаракатланиш ташқил қилинган. Сиз яқинлашиб келаётган чорраҳанинг қатнов қисми иккита ҳаракат бўлагига эга. Чорраҳага киришда бурилиш учун Сиз қайси бўлакни эгаллашингиз лозим?",
      answer: ["Ўнг бўлакни", "Чап бўлакни", "Ўнг ёки чап бўлакни"],
      right: 2,
    },
    {
      id: 8,
      img: null,
      question:
        "Сиз баландликда светофорнинг рухсат берувчи ишорасини кўтиб тўхтадингиз. Бунда автомобилни жойида тўтиб туришнинг энг яхши усули:",
      answer: [
        "Тўхтаб туриш тормози билан",
        "Биринчи ўзатма уланган ҳолда уловчини жойдан жилмай айлантириш ҳисобига",
        "Юргизгич ўчирилиб, паст ўзатма уланган ҳолда",
        "Ишчи тормоз билан",
      ],
      right: 0,
    },
    {
      id: 9,
      img: null,
      question:
        " Қайси ҳолларда велосипедчиларга қатнов қисмининг ўнг чеккасидан чиқишга йўл қўйилади?",
      answer: [
        "Юк ортиб кетаётганда",
        "Рухсат этилган ҳолларда чапга бурилиш ёки орқага қайтиш учун",
        "Иккала санаб ўтилган ҳолларда",
      ],
      right: 1,
    },
    {
      id: 10,
      img: null,
      question:
        "Пиёдаларга йўлни пиёдалар ўтиш жойидан ташқарида кесиб ўтишга рухсат этиладими?",
      answer: [
        " Рухсат этилади.",
        "Йўлни қатнов қисми четига тўғри бурчак остида, унинг иккала томони яхши кўриниб турадиган, кўриниш масофасида ўтиш жойи ёки чорраҳа бўлмаса, ажратувчи бўлаксиз ва тусиқсиз йўлларда кесиб ўтиш рухсат этилади",
        "Таъқиқланади",
      ],
      right: 1,
    },
    {
      id: 11,
      img: img312,
      question: "Шу жойда ҳовлига бурилишга рухсат этиладими?",
      answer: [" Рухсат этилади.", "Таъқиқланади."],
      right: 0,
    },
    {
      id: 12,
      img: img313,
      question:
        "Бу белгилар аҳоли яшайдиган жойларда ҳавфли йўл қисми бошланишидан қанча масофада ўрнатилади?",
      answer: ["15-25 м.", "25-50 м.", "50-100 м.", "100-150 м.", "150-300 м"],
      right: 2,
    },
    {
      id: 13,
      img: null,
      question: "Автомагистралда шатакка олишга рухсат бериладими?",
      answer: [
        "50 км/с тезлик билан рухсат этилган.",
        "Таъқиқланади.",
        "Фақат қисман ортиш усули билан ёки қаттиқ тиркагич билан рухсат берилади.",
        " Эгилувчан тиркагич билан рухсат берилади.",
        "Исталган усулда рухсат этилган",
      ],
      right: 4,
    },
    {
      id: 14,
      img: img315,
      question:
        "Белгиланган йўналиш бўйлаб кетаётган автобус ҳайдовчи  ушбу шароитда йўл бериши керакми?",
      answer: ["Керак.", "Керак эмас.", "Керак эмас, чунки у тўғрига кетаяпти"],
      right: 0,
    },
    {
      id: 15,
      img: img316,
      question: "Қайси транспорт воситаларига ҳаракатланишга рухсат этилади?",
      answer: [
        "Фақат қизил автомобилга.",
        " Барча транспорт воситаларига.",
        "Қизилб, кўк ва яшил автомобилларга.",
      ],
      right: 2,
    },
    {
      id: 16,
      img: img317,
      question:
        "Тиркамали енгил автомобилларга йўлнинг шундай йўл белгиси ўрнатилган қисмида қандай энг катта тезлик билан ҳаракатланишга рухсат этилади?",
      answer: ["60 км/c", "70 км/c", "80 км/c", "100 км/c", "110 км/c"],
      right: 2,
    },
    {
      id: 17,
      img: null,
      question:
        "Қайси ҳолда қоидалар огоҳлантириш ишорасини беришни талаб килмайди?",
      answer: [
        "Қатнов қисмининг чеккасида тўхташ олдидан.",
        "«Ҳавфли бурилиш» белгиси билан белгиланган йўлнинг эгри бурилиш жойи олдидан.",
        "Қўшни ҳаракат бўлагига ўтиш олдидан.",
      ],
      right: 1,
    },
    {
      id: 18,
      img: img319,
      question: "Бу йўл белгиси билдиради:",
      answer: [
        "Белгида кўрсатилгандан ортиқ юк кўтарувчи юк автомобиллари ва транспорт воситалари таркиби (тиркамали юк автомобиллари)нинг ҳаракат қилиши таъқиқланади.",
        "Умумий ҳақиқий вазни (йўловчилар ва юк вазнини қушган ҳолда) белгида кўрсатилгандан ортиқ бўлган транспорт воситалари, шу жумладан-тиркамали транспорт воситаларининг ҳаракат қилиши таъқиқланади.",
      ],
      right: 1,
    },
    {
      id: 19,
      img: null,
      question:
        "M2, M3 тоифали автотранспорт воситалари шина протекторлари нақшларининг қолдиқ баландлиги камида қанча бўлиши керак?",
      answer: ["0,8 мм.", "1,2 мм.", "1,6 мм.", "2 мм.", "2,5 мм."],
      right: 3,
    },
  ],




  
  [
    {
      quiz_id: 4,
      id: 0,
      img: null,
      question: "Светафорнинг яшил милтилловчи ишораси нимани билдиради? ",
      answer: [
        "Светафор носозлигини",
        "Ҳаракатга рухсат беради ва тез орада тақиқловчи ишора ёниши тўғрисида ахборот беради",
        "Ҳаракатни давом эттиришни тақиқлайди",
      ],
      right: 1,
    },
    {
      id: 1,
      img: img362,
      question:
        "Ушбу жойда автомобилни тўхтаб туриш учун қўйишга рухсат этиладими?",
      answer: ["Ҳа", "Нет"],
      right: 1,
    },
    {
      id: 2,
      img: img363,
      question:
        "Сиз чорраҳадан тўғрига ўтмоқчисиз. Ушбу вазиятда Сизнинг ҳаракатингиз?",
      answer: [
        "Чорраҳага биринчи кирган қизил автомобилга йўл бериш",
        "Қизил автомобиль йўл бераётганига ишонч хосил қилиб чорраҳадан биринчиўтиш",
      ],
      right: 1,
    },
    {
      id: 3,
      img: img364,
      question:
        "Сиз чорраҳадан чапга бурилмоқчисиз. Ушбу вазиятда кимга йўл берасиз?",
      answer: ["Фақат автобусга", "Фақат қизил автомобилга", "Ҳеч кимга"],
      right: 2,
    },
    {
      id: 4,
      img: null,
      question:
        "Қайси ҳолларда йўлнинг ҳаракатланиш бўлагини ажратувчи узуқ-узуқ чизиқни босиб ўтиш мумкин?",
      answer: [
        "Фақат қайта тизилишда",
        "Йўлда бошқа транспорт воситалари бўлмаса",
        "Барча санаб ўтилган ҳолларда",
      ],
      right: 0,
    },
    {
      id: 5,
      img: img366,
      question:
        " Ушбу кўрсатилган ҳолатда мототцикл ҳайдовчиси сизга йўл бериши керакми?",
      answer: ["Йўқ", "Ҳа "],
      right: 1,
    },
    {
      id: 6,
      question:
        "Санаб ўтилган қайси ҳолларда эгилувчан улагичда шатакка олиш тақиқланади?",
      answer: [
        "Фақат тоғли йўлларда",
        "Йўл яхмалак, сирпанчиқ бўлган ҳолларда",
        "Куннинг қоронғи вақтида ва етарли кўринмаслик шароитида",
        "Барча санаб ўтилган ҳолларда",
      ],
      right: 1,
    },
    {
      id: 7,
      img: img368,
      question:
        "Ушбу белгилардан қайси бири бир томонлама ҳаракат ташкил қилинган йўлнинг бошида ўpнaтилaди?",
      answer: ["Фақат «А» ", "Фақат «Б» ", "«Б» ва «Г» ", "«Б» ёки «В» "],
      right: 1,
    },
    {
      id: 8,
      img: img369,
      question: "Ушбу йўл нечта ҳаракатланиш бўлагига эга?",
      javob1: "",
      answer: [
        "Битта ҳаракатланиш бўлагига",
        "Иккита ҳаракатланиш бўлагига",
        "Учта ҳаракатланиш бўлагига",
      ],
      right: 1,
    },
    {
      id: 9,
      img: null,
      question:
        "Йўлда «ТЎХТАШ», ёзуви кўринишидаги йўл чизиғи нимани билдиради? ",
      answer: [
        "Тартибга солинган чорраҳада тўхташ чизиғига яқинлашаётганлиги хақида огоҳлантиради",
        "Тўхташ чизиғи ва «Тўхтамасдан ҳаракатланиш тақиқланади» йўл белгиси ўрнатилган йўл қисмига яқинлашаётганлигини билдиради",
        "«Йўл беринг» йўл белгисига яқинлашаётганлигини билдиради",
      ],
      right: 1,
    },
    {
      id: 10,
      img: img371,
      question: "Қайси ҳайдовчи тўхтаб туриш қоидасини бузди?",
      answer: [
        "Мототцикл ҳайдовчиси",
        "Тротуарда тўхтаб турган автомобиль ҳайдовчиси",
        "Ҳеч ким бузмади",
      ],
      right: 1,
    },
    {
      id: 11,
      img: null,
      question: "Typap жой даҳаларида қандай ҳаракатлар тақиқланган?",
      answer: [
        "Фақат ўқув машғулотларини бажариш",
        "Фақат двигатель ишлаб турганда тўхтаб туриш",
        "Барча санаб ўтилган ҳолларда",
      ],
      right: 2,
    },
    {
      id: 12,
      img: null,
      question:
        "Транспорт воситалари қаттиқ улагичда шатакка олинганда шатакка олган ва шатакка олинган транспорт воситалари орасидаги масофа қанча бўлиши керак?",
      answer: [
        "4 метрдан ошмаслиги",
        "4 метрдан 6 метргача",
        "Қоидаларда белгиланмаган",
      ],
      right: 0,
    },
    {
      id: 13,
      img: null,
      question:
        "Санаб ўтилган қайси ҳолатда транспорт воситасидан фойдаланишга рухсат этилади?",
      answer: [
        "Ташқи ёритгич асбоблари ифлосланган бўлса",
        "Ёритувчи чироқ нурининг йўналиши бузилган бўлса",
        "Олд қисмида - оқ ёки сариқ рангли туманга қарши фаралар ўрнатилган бўлса",
      ],
      right: 2,
    },
    {
      id: 14,
      img: null,
      question:
        "Йўлнинг сирпанчиқ қисмида руль чамбарагини кескин бурганда ҳосил бўладиган сирпанишнинг олдини олиш учун ҳайдовчи қандай эҳтиёт чораларини кўриши керак?",
      answer: [
        "Руль чамбарагини зудлик билан сирпанаётган томонга буриш ва тезда автомобилни ҳаракат йўналишини тўғирлаб олиш",
        "Илашмани узиш",
        "Тормоз тепкисини босиш",
      ],
      right: 0,
    },
    {
      id: 15,
      img: img376,
      question:
        "Кўрсатилган йўл белгиларидан қайси бири фақат йўл қопламаси нам бўлганда таъсир этади?",
      answer: ["Фақат «А»", "Фақат «А» ва «Б»", "Барчаси"],
      right: 0,
    },
    {
      id: 16,
      img: img377,
      question: "Юк автомобили ҳайдовчиси тўхтаб туриш қоидасини буздими?",
      answer: [
        "Бузди",
        "Бузмади, aгap унинг рухсат этилган тўлиқ вазни 3,5 тоннадан ошмаса",
        "Хато қилмади",
      ],
      right: 0,
    },
    {
      id: 17,
      img: null,
      question:
        "Қандай ҳолларда аҳоли пунктларида товуш мосламаларидан фойдаланишга рухсат этилади?",
      answer: [
        "Қувиб ўтишда огоҳлантириш учун",
        "Йўл-транспорт ҳодисасининг олдини олиш учун",
        "Ҳар иккала санаб ўтилган ҳолларда",
      ],
      right: 1,
    },
    {
      id: 18,
      img: img379,
      question:
        "Кўрсатилган қайси белгилар сизга яшаш манзилингизга автомобилда ўтишга рухсат беради?",
      answer: ["Фақат «А»", "Фақат «Б»", "Фақат «А» ва «B»", "Барчаси"],
      right: 2,
    },
    {
      id: 19,
      img: null,
      question:
        "Чорраҳага кирганингизда тартибга солувчи қўлини юқорига кўтарди, сизга ҳаракатланишга рухсат этиладими?",
      answer: [
        "Рухсат этилмайди",
        "Рухсат этилади, агарда сиз ўнгга буриладиган бўлсангиз",
        "Рухсат этилади",
      ],
      right: 2,
    },
  ],
];
